7767517
274 322
Input                    in0                      0 1 in0
Convolution              conv_16                  1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_83                  1 1 1 2
Convolution              conv_17                  1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_84                  1 1 3 4
Convolution              conv_18                  1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_85                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_19                  1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_86                  1 1 12 13
Convolution              conv_20                  1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_87                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_21                  1 1 17 18 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_88                  1 1 18 19
Convolution              conv_22                  1 1 19 20 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_89                  1 1 20 21
Convolution              conv_23                  1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_90                  1 1 22 23
Slice                    split_1                  1 2 23 24 25 -23300=2,32,32 1=0
Split                    splitncnn_1              1 3 25 26 27 28
Convolution              conv_24                  1 1 28 29 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_91                  1 1 29 30
Convolution              conv_25                  1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_92                  1 1 31 32
BinaryOp                 add_1                    2 1 27 32 33 0=0
Split                    splitncnn_2              1 3 33 34 35 36
Convolution              conv_26                  1 1 36 37 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_93                  1 1 37 38
Convolution              conv_27                  1 1 38 39 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_94                  1 1 39 40
BinaryOp                 add_2                    2 1 35 40 41 0=0
Concat                   cat_1                    4 1 24 26 34 41 42 0=0
Convolution              conv_28                  1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_95                  1 1 43 44
Split                    splitncnn_3              1 2 44 45 46
Convolution              conv_29                  1 1 46 47 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_96                  1 1 47 48
Convolution              conv_30                  1 1 48 49 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_97                  1 1 49 50
Slice                    split_2                  1 2 50 51 52 -23300=2,64,64 1=0
Split                    splitncnn_4              1 3 52 53 54 55
Convolution              conv_31                  1 1 55 56 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_98                  1 1 56 57
Convolution              conv_32                  1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_99                  1 1 58 59
BinaryOp                 add_3                    2 1 54 59 60 0=0
Split                    splitncnn_5              1 3 60 61 62 63
Convolution              conv_33                  1 1 63 64 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_100                 1 1 64 65
Convolution              conv_34                  1 1 65 66 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_101                 1 1 66 67
BinaryOp                 add_4                    2 1 62 67 68 0=0
Concat                   cat_2                    4 1 51 53 61 68 69 0=0
Convolution              conv_35                  1 1 69 70 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_102                 1 1 70 71
Split                    splitncnn_6              1 2 71 72 73
Convolution              conv_36                  1 1 73 74 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_103                 1 1 74 75
Convolution              conv_37                  1 1 75 76 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_104                 1 1 76 77
Slice                    split_3                  1 2 77 78 79 -23300=2,128,128 1=0
Split                    splitncnn_7              1 3 79 80 81 82
Convolution              conv_38                  1 1 82 83 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_105                 1 1 83 84
Convolution              conv_39                  1 1 84 85 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_106                 1 1 85 86
BinaryOp                 add_5                    2 1 81 86 87 0=0
Concat                   cat_3                    3 1 78 80 87 88 0=0
Convolution              conv_40                  1 1 88 89 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_107                 1 1 89 90
Convolution              conv_41                  1 1 90 91 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_108                 1 1 91 92
Split                    splitncnn_8              1 2 92 93 94
Pooling                  maxpool2d_80             1 1 94 95 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_9              1 2 95 96 97
Pooling                  maxpool2d_81             1 1 97 98 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_10             1 2 98 99 100
Pooling                  maxpool2d_82             1 1 100 101 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 93 96 99 101 102 0=0
Convolution              conv_42                  1 1 102 103 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_109                 1 1 103 104
Split                    splitncnn_11             1 2 104 105 106
Interp                   upsample_140             1 1 106 107 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_5                    2 1 107 72 108 0=0
Convolution              conv_43                  1 1 108 109 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_110                 1 1 109 110
Slice                    split_4                  1 2 110 111 112 -23300=2,64,64 1=0
Split                    splitncnn_12             1 2 112 113 114
Convolution              conv_44                  1 1 114 115 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_111                 1 1 115 116
Convolution              conv_45                  1 1 116 117 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_112                 1 1 117 118
Concat                   cat_6                    3 1 111 113 118 119 0=0
Convolution              conv_46                  1 1 119 120 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_113                 1 1 120 121
Split                    splitncnn_13             1 3 121 122 123 124
Pooling                  gap_0                    1 1 123 125 0=1 4=1
Pooling                  gmp_4                    1 1 124 126 0=0 4=1
Reshape                  reshape_148              1 1 125 127 0=1 1=1 2=-1
Squeeze                  squeeze_162              1 1 127 128 -23303=1,-1
Permute                  transpose_170            1 1 128 129 0=1
Convolution1D            conv1d_8                 1 1 129 130 0=1 1=3 2=1 3=1 4=1 5=0 6=3
Permute                  transpose_171            1 1 130 131 0=1
ExpandDims               unsqueeze_187            1 1 131 132 -23303=1,-1
Reshape                  reshape_149              1 1 126 133 0=1 1=1 2=-1
Squeeze                  squeeze_163              1 1 133 134 -23303=1,-1
Permute                  transpose_172            1 1 134 135 0=1
Convolution1D            conv1d_9                 1 1 135 136 0=1 1=3 2=1 3=1 4=1 5=0 6=3
Permute                  transpose_173            1 1 136 137 0=1
ExpandDims               unsqueeze_188            1 1 137 138 -23303=1,-1
BinaryOp                 add_6                    2 1 132 138 139 0=0
Sigmoid                  sigmoid_142              1 1 139 140
BinaryOp                 mul_7                    2 1 122 140 141 0=2
Split                    splitncnn_14             1 2 141 142 143
Interp                   upsample_141             1 1 143 144 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 144 45 145 0=0
Convolution              conv_47                  1 1 145 146 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_114                 1 1 146 147
Slice                    split_5                  1 2 147 148 149 -23300=2,32,32 1=0
Split                    splitncnn_15             1 2 149 150 151
Convolution              conv_48                  1 1 151 152 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_115                 1 1 152 153
Convolution              conv_49                  1 1 153 154 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_116                 1 1 154 155
Concat                   cat_8                    3 1 148 150 155 156 0=0
Convolution              conv_50                  1 1 156 157 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_117                 1 1 157 158
Split                    splitncnn_16             1 3 158 159 160 161
Pooling                  gap_1                    1 1 160 162 0=1 4=1
Pooling                  gmp_5                    1 1 161 163 0=0 4=1
Reshape                  reshape_150              1 1 162 164 0=1 1=1 2=-1
Squeeze                  squeeze_164              1 1 164 165 -23303=1,-1
Permute                  transpose_174            1 1 165 166 0=1
Convolution1D            conv1d_10                1 1 166 167 0=1 1=3 2=1 3=1 4=1 5=0 6=3
Permute                  transpose_175            1 1 167 168 0=1
ExpandDims               unsqueeze_189            1 1 168 169 -23303=1,-1
Reshape                  reshape_151              1 1 163 170 0=1 1=1 2=-1
Squeeze                  squeeze_165              1 1 170 171 -23303=1,-1
Permute                  transpose_176            1 1 171 172 0=1
Convolution1D            conv1d_11                1 1 172 173 0=1 1=3 2=1 3=1 4=1 5=0 6=3
Permute                  transpose_177            1 1 173 174 0=1
ExpandDims               unsqueeze_190            1 1 174 175 -23303=1,-1
BinaryOp                 add_8                    2 1 169 175 176 0=0
Sigmoid                  sigmoid_143              1 1 176 177
BinaryOp                 mul_9                    2 1 159 177 178 0=2
Split                    splitncnn_17             1 3 178 179 180 181
Convolution              conv_51                  1 1 181 182 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_118                 1 1 182 183
Concat                   cat_9                    2 1 183 142 184 0=0
Convolution              conv_52                  1 1 184 185 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_119                 1 1 185 186
Slice                    split_6                  1 2 186 187 188 -23300=2,64,64 1=0
Split                    splitncnn_18             1 2 188 189 190
Convolution              conv_53                  1 1 190 191 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_120                 1 1 191 192
Convolution              conv_54                  1 1 192 193 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_121                 1 1 193 194
Concat                   cat_10                   3 1 187 189 194 195 0=0
Convolution              conv_55                  1 1 195 196 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_122                 1 1 196 197
Split                    splitncnn_19             1 3 197 198 199 200
Pooling                  gap_2                    1 1 199 201 0=1 4=1
Pooling                  gmp_6                    1 1 200 202 0=0 4=1
Reshape                  reshape_152              1 1 201 203 0=1 1=1 2=-1
Squeeze                  squeeze_166              1 1 203 204 -23303=1,-1
Permute                  transpose_178            1 1 204 205 0=1
Convolution1D            conv1d_12                1 1 205 206 0=1 1=3 2=1 3=1 4=1 5=0 6=3
Permute                  transpose_179            1 1 206 207 0=1
ExpandDims               unsqueeze_191            1 1 207 208 -23303=1,-1
Reshape                  reshape_153              1 1 202 209 0=1 1=1 2=-1
Squeeze                  squeeze_167              1 1 209 210 -23303=1,-1
Permute                  transpose_180            1 1 210 211 0=1
Convolution1D            conv1d_13                1 1 211 212 0=1 1=3 2=1 3=1 4=1 5=0 6=3
Permute                  transpose_181            1 1 212 213 0=1
ExpandDims               unsqueeze_192            1 1 213 214 -23303=1,-1
BinaryOp                 add_10                   2 1 208 214 215 0=0
Sigmoid                  sigmoid_144              1 1 215 216
BinaryOp                 mul_11                   2 1 198 216 217 0=2
Split                    splitncnn_20             1 3 217 218 219 220
Convolution              conv_56                  1 1 220 221 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_123                 1 1 221 222
Concat                   cat_11                   2 1 222 105 223 0=0
Convolution              conv_57                  1 1 223 224 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_124                 1 1 224 225
Slice                    split_7                  1 2 225 226 227 -23300=2,128,128 1=0
Split                    splitncnn_21             1 2 227 228 229
Convolution              conv_58                  1 1 229 230 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_125                 1 1 230 231
Convolution              conv_59                  1 1 231 232 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_126                 1 1 232 233
Concat                   cat_12                   3 1 226 228 233 234 0=0
Convolution              conv_60                  1 1 234 235 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_127                 1 1 235 236
Split                    splitncnn_22             1 3 236 237 238 239
Pooling                  gap_3                    1 1 238 240 0=1 4=1
Pooling                  gmp_7                    1 1 239 241 0=0 4=1
Reshape                  reshape_154              1 1 240 242 0=1 1=1 2=-1
Squeeze                  squeeze_168              1 1 242 243 -23303=1,-1
Permute                  transpose_182            1 1 243 244 0=1
Convolution1D            conv1d_14                1 1 244 245 0=1 1=3 2=1 3=1 4=1 5=0 6=3
Permute                  transpose_183            1 1 245 246 0=1
ExpandDims               unsqueeze_193            1 1 246 247 -23303=1,-1
Reshape                  reshape_155              1 1 241 248 0=1 1=1 2=-1
Squeeze                  squeeze_169              1 1 248 249 -23303=1,-1
Permute                  transpose_184            1 1 249 250 0=1
Convolution1D            conv1d_15                1 1 250 251 0=1 1=3 2=1 3=1 4=1 5=0 6=3
Permute                  transpose_185            1 1 251 252 0=1
ExpandDims               unsqueeze_194            1 1 252 253 -23303=1,-1
BinaryOp                 add_12                   2 1 247 253 254 0=0
Sigmoid                  sigmoid_145              1 1 254 255
BinaryOp                 mul_13                   2 1 237 255 256 0=2
Split                    splitncnn_23             1 2 256 257 258
MemoryData               pnnx_199                 0 1 259 0=8400
Convolution              conv_61                  1 1 180 260 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_128                 1 1 260 261
Convolution              conv_62                  1 1 261 262 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_129                 1 1 262 263
Convolution              conv_63                  1 1 263 264 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_64                  1 1 179 265 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_130                 1 1 265 266
Convolution              conv_65                  1 1 266 267 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_131                 1 1 267 268
Convolution              conv_66                  1 1 268 269 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=320
Concat                   cat_13                   2 1 264 269 270 0=0
Convolution              conv_67                  1 1 219 271 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_132                 1 1 271 272
Convolution              conv_68                  1 1 272 273 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_133                 1 1 273 274
Convolution              conv_69                  1 1 274 275 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_70                  1 1 218 276 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_134                 1 1 276 277
Convolution              conv_71                  1 1 277 278 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_135                 1 1 278 279
Convolution              conv_72                  1 1 279 280 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=320
Concat                   cat_14                   2 1 275 280 281 0=0
Convolution              conv_73                  1 1 258 282 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_136                 1 1 282 283
Convolution              conv_74                  1 1 283 284 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_137                 1 1 284 285
Convolution              conv_75                  1 1 285 286 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_76                  1 1 257 287 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_138                 1 1 287 288
Convolution              conv_77                  1 1 288 289 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_139                 1 1 289 290
Convolution              conv_78                  1 1 290 291 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=320
Concat                   cat_15                   2 1 286 291 292 0=0
Reshape                  view_157                 1 1 270 293 0=6400 1=69
Reshape                  view_158                 1 1 281 294 0=1600 1=69
Reshape                  view_159                 1 1 292 295 0=400 1=69
Concat                   cat_16                   3 1 293 294 295 296 0=1
Slice                    split_8                  1 2 296 297 298 -23300=2,64,5 1=0
Reshape                  view_160                 1 1 297 299 0=8400 1=16 2=4
Permute                  transpose_186            1 1 299 300 0=2
Softmax                  softmax_147              1 1 300 301 0=0 1=1
Convolution              conv_79                  1 1 301 302 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_161                 1 1 302 303 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 304 0=8400 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 305 0=8400 1=2
Slice                    chunk_0                  1 2 303 306 307 -23300=2,-233,-233 1=0
BinaryOp                 sub_14                   2 1 304 306 308 0=1
Split                    splitncnn_24             1 2 308 309 310
BinaryOp                 add_15                   2 1 305 307 311 0=0
Split                    splitncnn_25             1 2 311 312 313
BinaryOp                 add_16                   2 1 309 312 314 0=0
BinaryOp                 div_17                   1 1 314 315 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_18                   2 1 313 310 316 0=1
Concat                   cat_17                   2 1 315 316 317 0=0
Reshape                  reshape_156              1 1 259 318 0=8400 1=1
BinaryOp                 mul_19                   2 1 317 318 319 0=2
Sigmoid                  sigmoid_146              1 1 298 320
Concat                   cat_18                   2 1 319 320 out0 0=0
